# Implementação do sql para analise de dados com python

In [30]:
# instalando pacote ipython-sql
#!pip install -q ipython-sql

In [2]:
#imports
import pandas as pd
import sqlite3

### Banco relacional, python e sql

In [3]:
#Criando um DataFrame
dados = pd.DataFrame({'Nome':['Siri','Alexa','Cortana'],
                    'Idade':[28,47,18],
                    'Cargo':['Analista de dados', 'Cientista de dados', 'Engenheiro de dados']})

In [4]:
dados.head()

      Nome  Idade                Cargo
0     Siri     28    Analista de dados
1    Alexa     47   Cientista de dados
2  Cortana     18  Engenheiro de dados

In [13]:
#apagando banco de dados
!del database\projeto1.db

C:\Users\Michael\Desktop\PROJETO PYTHON\implementa‡Æo sql\database\projeto1.db

O arquivo j  est  sendo usado por outro processo.

In [6]:
# Criando conexão com o banco de dados SQLite
cnn = sqlite3.connect('database/dbprojeto1.db')

In [7]:
# Copia o dataframe para dentro do banco de dados como uma tabela
dados.to_sql('funcionarios',cnn)

3

In [8]:
#Carregando a extesão SQL
%load_ext sql

In [11]:
#Definindo o banco de dados
%sql sqlite:///database/dbprojeto1.db

consultando SQL usando direfente Liguagem SQL dentro do Jupyter Notebook.

In [26]:
%%sql
SELECT * from funcionarios

 * sqlite:///database/dbprojeto1.db
   sqlite:///database/projeto1.db
Done.

[(0, 'Siri', 28, 'Analista de dados'),
 (1, 'Alexa', 47, 'Cientista de dados'),
 (2, 'Cortana', 18, 'Engenheiro de dados')]

consultando a tabela funcionarios

In [28]:
%%sql 
SELECT count(*) FROM funcionarios

 * sqlite:///database/dbprojeto1.db
   sqlite:///database/projeto1.db
Done.

[(3,)]

consultando o número total de linhas na tabela funcionarios

In [29]:
%%sql
SELECT avg(idade) as 'idade_media' FROM funcionarios

 * sqlite:///database/dbprojeto1.db
   sqlite:///database/projeto1.db
Done.

[(31.0,)]

Fazendo uma operação de media com a tabela idade usando função 'avg'